/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   exec.h                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sakitaha <sakitaha@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/03/06 18:59:42 by sakitaha          #+#    #+#             */
/*   Updated: 2024/03/07 14:33:43 by sakitaha         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef EXEC_H
# define EXEC_H

/**
 * mockは、exec部分のロジックをテストするために使用する仮の構造体と関数
 * モックは、xv6のsh.c実装を参考にしている
 * TODO: このモックヘッダーのincludeは、後に削除する
 */

# include "mock.h"

void	error_exit(char *s);

#endif
